modules/admin/controllers/UserController.php

SELECT * FROM `tbl_user` WHERE `id`='40'
---
    protected function findModel($id)
    {
        if (($model = User::findOne($id)) !== null) {