controllers/SiteController.php

    public function actionFront()
    {
        $this->layout = 'landing-page-layout';
        Yii::setAlias("@imagesUrl", "@web/uploads");
        /** Admin case after login */
        $testimonialModel= Testimonials::find()->all();
---
SELECT * FROM `tbl_testimonials`