controllers/UserController.php

SELECT * FROM `tbl_user_categories` WHERE `id`=0
---
    public function actionProfile($id)
    {
        try {
            $this->layout = 'inner-layout';
            Yii::setAlias("@imagesUrl", "@web/uploads");
            $dataProvider = new ActiveDataProvider([
                'query' => UserPlans::find()->select('
                tbl_user_plans.expiration_date,
                tbl_user_plans.created_at,
                tbl_user_plans.is_cancel,
                tbl_user_plans.status,
                tbl_user_plans.isExpire,
                tbl_user_plans.reference_id,
                tbl_transactions.amount_paid,
                tbl_transactions.created_at'
                )->leftJoin('tbl_transactions', '`tbl_transactions`.`reference_id` = `tbl_user_plans`.`reference_id`')
                ->where(['user_id' => Yii::$app->user->getId()])
                ->andWhere(['tbl_user_plans.status' => 1]),
                'pagination' => [
                    'pageSize' => 5,
                ],
            ]);

            $userModel = $this->findModel($id);
            $getCategoryData = UserCategories::find()->where(['id' => $userModel->user_category_id])->one();

SELECT * FROM `tbl_user` WHERE `id`='41'
---
    public function actionTransactions($id)
    {
        try {
            $this->layout = 'inner-layout';
            Yii::setAlias("@imagesUrl", "@web/uploads");
            $dataProvider = new ActiveDataProvider([
                'query' => UserPlans::find()->select('
                tbl_user_plans.expiration_date,
                tbl_user_plans.created_at,
                tbl_user_plans.is_cancel,
                tbl_user_plans.status,
                tbl_user_plans.isExpire,
                tbl_user_plans.reference_id,
                tbl_transactions.amount_paid,
                tbl_transactions.created_at'
                )->leftJoin('tbl_transactions', '`tbl_transactions`.`reference_id` = `tbl_user_plans`.`reference_id`')
                ->where(['user_id' => Yii::$app->user->getId()])
                ->andWhere(['tbl_user_plans.status' => 1]),
                'pagination' => [
                    'pageSize' => 15,
                ],
            ]);

            $changePasswordModel = new ChangePasswordForm($id);
            if ($changePasswordModel->load(\Yii::$app->request->post())) {

SELECT * FROM `tbl_user` WHERE `id`=42
SELECT SUM(credit_used) FROM `tbl_user_records` WHERE `user_id`=39
---
    public function actionDetails($id)
    {
        $this->layout = 'inner-layout';
        Yii::setAlias("@imagesUrl", "@web/uploads");
        $planCredits = 0;
        $userModel = new User();
        $planModel =  UserPlans::find()->where(['user_id' => $id])->with('plans')->andWhere(['isExpire' => 0])->andWhere(['is_cancel' => 0])->andWhere(['status' => 1])->one();
        if ($planModel) {
            $planCredits = $planModel->credits;
        }
        $userdata= User::findOne($id);
        $totalCredits = $userModel->getTotalCredits();
        $remaining_business_credits = $userdata->business_credits;
        $remaining_personal_credits =  $planCredits +  $userdata->personal_credits;
        $bcredits_used = 0;
        $pcredits_used = 0;
        if ($userdata->parent_id > 0) {
            $pcredits_used = UserRecords::find()->where(['user_id' => $id, 'account_type' => 1])->sum('credit_used');
            $remaining_personal_credits =  ($userdata->personal_credits +  $planCredits)  - $pcredits_used;
            $bcredits_used = UserRecords::find()->where(['user_id' => $id, 'account_type' => 2])->sum('credit_used');
            $remaining_business_credits =  $userdata->business_credits - $bcredits_used;
        } else {
            $pcredits_used = UserRecords::find()->where(['user_id' => $id, 'account_type' => 1])->sum('credit_used');
            $business_credit_assigned = User::find()->where(['parent_id' => $id])->sum('business_credits');
            $remaining_personal_credits =  $totalCredits - ($pcredits_used + $business_credit_assigned);
            $pcredits_used= $pcredits_used + $business_credit_assigned;
        }

        $dataProvider = new ActiveDataProvider([
            'query' => UserRecords::find()->where([
                'user_id' => $id
            ])
                ->orderBy([
                    'id' => SORT_DESC
                ]),
            'pagination' => [
                'pageSize' => 5,
            ],
        ]);