models/ChangePasswordForm.php

    public function __construct($id, $config = [])
    {
        $this->_user = User::findOne($id);
---
SELECT * FROM `tbl_user` WHERE `id`='42'