models/User.php

    public static function findIdentity($id)
    {
        $user = User::findOne($id);
---
SELECT * FROM `tbl_user` WHERE `id`=1

    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email]);
---
SELECT * FROM `tbl_user` WHERE `email`='admin@nocopy.com'

        public function sendTestEmail($user_id){
        $user = User::findOne([
            'id' => $user_id
        ]);
---
SELECT * FROM `tbl_user` WHERE `id`='41'